#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_client_config.provider: Reading...
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-314241/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-314241-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-314241-code]
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-314241/artifactregistry.googleapis.com]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-314241"/regions/"europe-west1"/zones/<null>]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-314241/global/firewalls/default-internal-allow-all]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-314241/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-314241/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-314241/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-314241/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-314241/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-314241/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-314241/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-314241/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-314241/serviceAccounts/tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-314241/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-314241/roles/dataproc.editor/serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-314241/roles/composer.worker/serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-314241/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-314241/locations/europe/repositories/eu.gcr.io]
module.composer.module.composer.data.google_project.project: Reading...
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-314241/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2024l-314241]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-314241/roles/composer.ServiceAgentV2Ext/serviceAccount:service-38963198750@cloudcomposer-accounts.iam.gserviceaccount.com]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-314241/locations/europe-west1/environments/demo-lab]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:2893c167a4345da5817c6f20b36904f906f8023e1fa5ec1f6bcc26930fe75032eu.gcr.io/tbd-2024l-314241/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:2da26c02fb88b40df16b4329177c5acc3b956b50d164c05c88ef0c33f2c1a35e]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-314241/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-314241/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-314241-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-314241-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-314241-conf-scripts/notebook_post_startup_script.sh]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-079b98c5-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-079b98c5-bucket-dags/dbt-dag.py]
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:edc8deb6438a0d78a38159b8d49da4e7bd5343e9679e4235f56b21daaebaa294eu.gcr.io/tbd-2024l-314241/dbt:1.7.13]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:b11bd3a05553eb0f375f1630a1cca28c2401366670ac2bb5b9900c82b86394d4]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-314241/locations/europe-west1-b/instances/tbd-2024l-314241-notebook]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-314241-data/roles/storage.objectUser/serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-314241-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-314241-code-spark-job.py]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket has been deleted
  - resource "google_storage_bucket" "tbd-code-bucket" {
        id                          = "tbd-2024l-314241-code"
      - name                        = "tbd-2024l-314241-code" -> null
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket has been deleted
  - resource "google_storage_bucket" "tbd-data-bucket" {
        id                          = "tbd-2024l-314241-data"
      - name                        = "tbd-2024l-314241-data" -> null
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id          = "sha256:edc8deb6438a0d78a38159b8d49da4e7bd5343e9679e4235f56b21daaebaa294eu.gcr.io/tbd-2024l-314241/dbt:1.7.13"
      - name        = "eu.gcr.io/tbd-2024l-314241/dbt:1.7.13" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id          = "sha256:2893c167a4345da5817c6f20b36904f906f8023e1fa5ec1f6bcc26930fe75032eu.gcr.io/tbd-2024l-314241/jupyter:3.6.3"
      - name        = "eu.gcr.io/tbd-2024l-314241/jupyter:3.6.3" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env has been deleted
  - resource "google_composer_environment" "composer_env" {
      - effective_labels = {} -> null
      - id               = "projects/tbd-2024l-314241/locations/europe-west1/environments/demo-lab" -> null
      - labels           = {} -> null
      - name             = "demo-lab" -> null
      - project          = "tbd-2024l-314241" -> null
      - region           = "europe-west1" -> null
      - terraform_labels = {} -> null

      - config {
          - airflow_uri                = "https://de6812ffe3394a1d90ef7a507ebb3042-dot-europe-west1.composer.googleusercontent.com" -> null
          - dag_gcs_prefix             = "gs://europe-west1-demo-lab-079b98c5-bucket/dags" -> null
          - enable_private_builds_only = false -> null
          - enable_private_environment = false -> null
          - environment_size           = "ENVIRONMENT_SIZE_SMALL" -> null
          - gke_cluster                = "projects/tbd-2024l-314241/locations/europe-west1/clusters/europe-west1-demo-lab-079b98c5-gke" -> null
          - node_count                 = 0 -> null
          - resilience_mode            = "STANDARD_RESILIENCE" -> null

          - data_retention_config {
              - task_logs_retention_config {
                  - storage_mode = "CLOUD_LOGGING_AND_CLOUD_STORAGE" -> null
                }
            }

          - database_config {
                # (2 unchanged attributes hidden)
            }

          - encryption_config {
                # (1 unchanged attribute hidden)
            }

          - maintenance_window {
              - end_time   = "1970-01-01T04:00:00Z" -> null
              - recurrence = "FREQ=WEEKLY;BYDAY=FR,SA,SU" -> null
              - start_time = "1970-01-01T00:00:00Z" -> null
            }

          - node_config {
              - disk_size_gb                      = 0 -> null
              - enable_ip_masq_agent              = false -> null
              - ip_allocation_policy              = [
                  - {
                      - use_ip_aliases                = false
                        # (4 unchanged attributes hidden)
                    },
                ] -> null
              - max_pods_per_node                 = 0 -> null
              - network                           = "projects/tbd-2024l-314241/global/networks/main-vpc" -> null
              - oauth_scopes                      = [] -> null
              - service_account                   = "tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com" -> null
              - subnetwork                        = "projects/tbd-2024l-314241/regions/europe-west1/subnetworks/composer-subnet-01" -> null
              - tags                              = [] -> null
                # (4 unchanged attributes hidden)
            }

          - private_environment_config {
              - cloud_composer_network_ipv4_cidr_block = "172.31.251.0/24" -> null
              - cloud_sql_ipv4_cidr_block              = "10.0.0.0/12" -> null
              - enable_private_endpoint                = false -> null
              - enable_privately_used_public_ips       = false -> null
                # (4 unchanged attributes hidden)
            }

          - software_config {
              - airflow_config_overrides = {} -> null
              - env_variables            = {
                  - "AIRFLOW_VAR_BUCKET_NAME"         = "tbd-2024l-314241-code"
                  - "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git"
                  - "AIRFLOW_VAR_DBT_GIT_REPO_BRANCH" = "main"
                  - "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster"
                  - "AIRFLOW_VAR_PROJECT_ID"          = "tbd-2024l-314241"
                  - "AIRFLOW_VAR_REGION_NAME"         = "europe-west1"
                  - "AIRFLOW_VAR_WRK_NAMESPACE"       = "composer-user-workloads"
                } -> null
              - image_version            = "composer-2.6.1-airflow-2.5.3" -> null
              - pypi_packages            = {} -> null
              - scheduler_count          = 0 -> null
                # (2 unchanged attributes hidden)

              - cloud_data_lineage_integration {
                  - enabled = false -> null
                }
            }

          - web_server_network_access_control {
              - allowed_ip_range {
                  - description = "Allows access from all IPv4 addresses (default value)" -> null
                  - value       = "0.0.0.0/0" -> null
                }
              - allowed_ip_range {
                  - description = "Allows access from all IPv6 addresses (default value)" -> null
                  - value       = "::0/0" -> null
                }
            }

          - workloads_config {
              - scheduler {
                  - count      = 1 -> null
                  - cpu        = 0.5 -> null
                  - memory_gb  = 1.875 -> null
                  - storage_gb = 1 -> null
                }
              - web_server {
                  - cpu        = 0.5 -> null
                  - memory_gb  = 1.875 -> null
                  - storage_gb = 1 -> null
                }
              - worker {
                  - cpu        = 0.5 -> null
                  - max_count  = 3 -> null
                  - memory_gb  = 1.875 -> null
                  - min_count  = 1 -> null
                  - storage_gb = 1 -> null
                }
            }
        }

      - storage_config {
          - bucket = "europe-west1-demo-lab-079b98c5-bucket" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.google_container_cluster.composer-gke-cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "composer-gke-cluster" {
      + addons_config                            = (known after apply)
      + allow_net_admin                          = (known after apply)
      + authenticator_groups_config              = (known after apply)
      + binary_authorization                     = (known after apply)
      + cluster_autoscaling                      = (known after apply)
      + cluster_ipv4_cidr                        = (known after apply)
      + confidential_nodes                       = (known after apply)
      + cost_management_config                   = (known after apply)
      + database_encryption                      = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + default_snat_status                      = (known after apply)
      + deletion_protection                      = (known after apply)
      + description                              = (known after apply)
      + dns_config                               = (known after apply)
      + enable_autopilot                         = (known after apply)
      + enable_cilium_clusterwide_network_policy = (known after apply)
      + enable_intranode_visibility              = (known after apply)
      + enable_k8s_beta_apis                     = (known after apply)
      + enable_kubernetes_alpha                  = (known after apply)
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = (known after apply)
      + enable_multi_networking                  = (known after apply)
      + enable_shielded_nodes                    = (known after apply)
      + enable_tpu                               = (known after apply)
      + endpoint                                 = (known after apply)
      + fleet                                    = (known after apply)
      + gateway_api_config                       = (known after apply)
      + id                                       = (known after apply)
      + identity_service_config                  = (known after apply)
      + initial_node_count                       = (known after apply)
      + ip_allocation_policy                     = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-west1"
      + logging_config                           = (known after apply)
      + logging_service                          = (known after apply)
      + maintenance_policy                       = (known after apply)
      + master_auth                              = (known after apply)
      + master_authorized_networks_config        = (known after apply)
      + master_version                           = (known after apply)
      + mesh_certificates                        = (known after apply)
      + min_master_version                       = (known after apply)
      + monitoring_config                        = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = (known after apply)
      + network                                  = (known after apply)
      + network_policy                           = (known after apply)
      + networking_mode                          = (known after apply)
      + node_config                              = (known after apply)
      + node_locations                           = (known after apply)
      + node_pool                                = (known after apply)
      + node_pool_auto_config                    = (known after apply)
      + node_pool_defaults                       = (known after apply)
      + node_version                             = (known after apply)
      + notification_config                      = (known after apply)
      + operation                                = (known after apply)
      + private_cluster_config                   = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + release_channel                          = (known after apply)
      + remove_default_node_pool                 = (known after apply)
      + resource_labels                          = (known after apply)
      + resource_usage_export_config             = (known after apply)
      + security_posture_config                  = (known after apply)
      + self_link                                = (known after apply)
      + service_external_ips_config              = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
      + vertical_pod_autoscaling                 = (known after apply)
      + workload_identity_config                 = (known after apply)
    }

  # google_compute_firewall.allow-all-internal will be created
  + resource "google_compute_firewall" "allow-all-internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-all-internal"
      + network            = "main-vpc"
      + priority           = 1000
      + project            = "tbd-2024l-314241"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.composer.google_project_iam_member.dataproc-editor-iam will be created
  + resource "google_project_iam_member" "dataproc-editor-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com"
      + project = "tbd-2024l-314241"
      + role    = "roles/dataproc.editor"
    }

  # module.composer.google_project_iam_member.dataproc-sa-user-iam will be created
  + resource "google_project_iam_member" "dataproc-sa-user-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com"
      + project = "tbd-2024l-314241"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket will be created
  + resource "google_storage_bucket" "tbd-code-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2024l-314241-code"
      + project                     = "tbd-2024l-314241"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = false
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket will be created
  + resource "google_storage_bucket" "tbd-data-bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2024l-314241-data"
      + project                     = "tbd-2024l-314241"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = false
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer will be created
  + resource "google_storage_bucket_iam_member" "tbd-code-bucket-iam-viewer" {
      + bucket = "tbd-2024l-314241-code"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor will be created
  + resource "google_storage_bucket_iam_member" "tbd-data-bucket-iam-editor" {
      + bucket = "tbd-2024l-314241-data"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com"
      + role   = "roles/storage.objectUser"
    }

  # module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"] will be created
  + resource "google_storage_bucket_object" "dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/data-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"] will be created
  + resource "google_storage_bucket_object" "dbt-dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/dbt-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] will be created
  + resource "google_storage_bucket_object" "job-code" {
      + bucket         = "tbd-2024l-314241-code"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "spark-job.py"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/spark-job.py"
      + storage_class  = (known after apply)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-314241/dbt:1.7.13"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.13"
              + "PROJECT_NAME"      = "tbd-2024l-314241"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-314241/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.gcr.google_artifact_registry_repository.registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "registry" {
        id                     = "projects/tbd-2024l-314241/locations/europe/repositories/eu.gcr.io"
        name                   = "eu.gcr.io"
        # (13 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-314241/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-314241"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/jupyter_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-314241/jupyter:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-314241"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time            = (known after apply)
      + desired_state          = "ACTIVE"
      + disk_encryption        = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + instance_owners        = [
          + "maksymilian.banach.praca@gmail.com",
        ]
      + location               = "europe-west1-b"
      + machine_type           = "e2-standard-2"
      + metadata               = {
          + "vmDnsSetting" = "GlobalDefault"
        }
      + name                   = "tbd-2024l-314241-notebook"
      + network                = "projects/tbd-2024l-314241/global/networks/main-vpc"
      + no_proxy_access        = true
      + no_public_ip           = true
      + post_startup_script    = "gs://tbd-2024l-314241-conf/scripts/notebook_post_startup_script.sh"
      + project                = "tbd-2024l-314241"
      + proxy_uri              = (known after apply)
      + service_account        = (known after apply)
      + service_account_scopes = (known after apply)
      + state                  = (known after apply)
      + subnet                 = "projects/tbd-2024l-314241/regions/europe-west1/subnetworks/subnet-01"
      + tags                   = (known after apply)
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2024l-314241/jupyter"
          + tag        = "3.6.3"
        }

      + shielded_instance_config (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-314241/roles/iam.serviceAccountTokenCreator"
      ~ members = [] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-314241-conf/roles/storage.objectViewer"
      ~ members = [] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be created
  + resource "google_composer_environment" "composer_env" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "demo-lab"
      + project          = "tbd-2024l-314241"
      + region           = "europe-west1"
      + terraform_labels = (known after apply)

      + config {
          + airflow_uri                = (known after apply)
          + dag_gcs_prefix             = (known after apply)
          + enable_private_builds_only = (known after apply)
          + enable_private_environment = (known after apply)
          + environment_size           = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster                = (known after apply)
          + node_count                 = (known after apply)
          + resilience_mode            = (known after apply)

          + data_retention_config (known after apply)

          + database_config (known after apply)

          + encryption_config (known after apply)

          + maintenance_window (known after apply)

          + node_config {
              + composer_internal_ipv4_cidr_block = (known after apply)
              + composer_network_attachment       = (known after apply)
              + disk_size_gb                      = (known after apply)
              + enable_ip_masq_agent              = false
              + ip_allocation_policy              = (known after apply)
              + machine_type                      = (known after apply)
              + max_pods_per_node                 = (known after apply)
              + network                           = "projects/tbd-2024l-314241/global/networks/main-vpc"
              + oauth_scopes                      = (known after apply)
              + service_account                   = "tbd-2024l-314241-data@tbd-2024l-314241.iam.gserviceaccount.com"
              + subnetwork                        = "projects/tbd-2024l-314241/regions/europe-west1/subnetworks/composer-subnet-01"
              + zone                              = (known after apply)
            }

          + private_environment_config (known after apply)

          + software_config {
              + env_variables           = {
                  + "AIRFLOW_VAR_BUCKET_NAME"         = "tbd-2024l-314241-code"
                  + "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git"
                  + "AIRFLOW_VAR_DBT_GIT_REPO_BRANCH" = "main"
                  + "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster"
                  + "AIRFLOW_VAR_PROJECT_ID"          = "tbd-2024l-314241"
                  + "AIRFLOW_VAR_REGION_NAME"         = "europe-west1"
                  + "AIRFLOW_VAR_WRK_NAMESPACE"       = "composer-user-workloads"
                }
              + image_version           = "composer-2.6.1-airflow-2.5.3"
              + python_version          = (known after apply)
              + scheduler_count         = (known after apply)
              + web_server_plugins_mode = (known after apply)

              + cloud_data_lineage_integration (known after apply)
            }

          + web_server_config (known after apply)

          + web_server_network_access_control (known after apply)

          + workloads_config {
              + dag_processor (known after apply)
              + scheduler {
                  + count      = 1
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + triggerer (known after apply)
              + web_server {
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + worker {
                  + cpu        = 0.5
                  + max_count  = 3
                  + memory_gb  = 1.875
                  + min_count  = 1
                  + storage_gb = 1
                }
            }
        }

      + storage_config (known after apply)
    }

Plan: 14 to add, 3 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

```

</details>

*Pusher: @JakubPrzesmycki, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*